#pragma once
#include "S3DGameLib.h"

struct Vertex
{
	float x;
	float y;
	float z;
};


class Sample : public SCore
{
public:
	//========================================================================
	// 버퍼 및 레이아웃
	//========================================================================
	ID3D11Buffer*			m_pVertexBuffer;
	ID3D11Buffer*			m_pIndexBuffer;
	ID3D11InputLayout*		m_pVertexLayout;
	//========================================================================
	// 버텍스 및 픽셀 쉐이더
	//========================================================================
	ID3D11VertexShader*			m_pVS;
	ID3D11PixelShader*			m_pPS;
public:
	//========================================================================
	// 정점 버퍼 생성
	//========================================================================
	HRESULT CreateVertexBuffer();
	//========================================================================
	// 정점 및 픽쉘 쉐이더 로딩 및 생성
	//========================================================================
	HRESULT LoadShaderAndInputLayout();
	//========================================================================
	// 재정의 함수들
	//========================================================================
	bool		Init();
	bool		Frame();
	bool		Render();
	bool		Release();
public:
	Sample();
	~Sample();
};

