#pragma once
#define _CRT_SECURE_NO_WARNINGS

#include "S3DGameLib.h"

//====================================================================
// Structures
//====================================================================
struct SimpleVertex
{
	float x;
	float y;
	float z;
};

struct VSCB
{
	D3DXMATRIX mat;

	float fTime;
	float fC5_Y;
	float fC5_Z;
	float fC5_W;
};
class Sample : public SCore
{
public:
	//====================================================================
	// 버텍스 버퍼 및 레이아웃
	//====================================================================
	ID3D11InputLayout*	m_pVertexLayout;
	ID3D11Buffer*		m_pVertexBuffer;
	ID3D11Buffer*		m_pIndexBurffer;
	ID3D11Buffer*		m_pConstantBuffer;
	//====================================================================
	// 버텍스 및 픽셀 쉐이더
	//====================================================================
	ID3D11VertexShader*		m_pVertexShader;
	ID3D11PixelShader*		m_pPixelShader;
	D3D_PRIMITIVE_TOPOLOGY	m_PrimType;

public:
	//====================================================================
	// 삼각형 생성 및 초기화
	//====================================================================
	HRESULT	CreateTriangle(D3D_PRIMITIVE_TOPOLOGY iTopology = D3D_PRIMITIVE_TOPOLOGY_TRIANGLELIST);

	//====================================================================
	// 정점 및 픽셀 쉐이더 로딩 및 생성
	//====================================================================
	HRESULT LoadShaderAndInputLayout();

	//====================================================================
	// 정점 버퍼 생성
	//====================================================================
	HRESULT CreateVertexBuffer();

	//====================================================================
	// 인덱스 버퍼 생성
	//====================================================================
	HRESULT CreateIndexBuffer();

	//====================================================================
	// 상수 버퍼 생성
	//====================================================================
	HRESULT CreateConstantBuffer();

	//====================================================================
	// 재정의 함수
	//====================================================================
	bool	Init();
	bool	Frame();
	bool	Render();
	bool	Release();
public:
	Sample();
	~Sample();
};

